-- phpMyAdmin SQL Dump
-- version 4.5.5.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016-12-02 22:17:43
-- 服务器版本： 5.7.11
-- PHP Version: 5.5.36

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `stock`
--

-- --------------------------------------------------------

--
-- 表的结构 `bigtrade`
--

CREATE TABLE `bigtrade` (
  `date` date NOT NULL COMMENT '大宗交易日期',
  `num` varchar(8) NOT NULL COMMENT '股票代码',
  `name` varchar(255) NOT NULL COMMENT '股票名称',
  `dealprice` double NOT NULL COMMENT '成交价',
  `closeprice` double NOT NULL COMMENT '收盘价',
  `islimited` tinyint(1) DEFAULT NULL COMMENT AS `是否涨停`,
  `discount` double DEFAULT NULL COMMENT AS `溢价率`,
  `volume` double DEFAULT NULL COMMENT AS `成交量`,
  `volumemoney` double DEFAULT NULL COMMENT AS `成交金额`,
  `dealrate` double DEFAULT NULL COMMENT AS `成交比例`,
  `buy` varchar(255) NOT NULL COMMENT '买方营业部',
  `sell` varchar(255) NOT NULL COMMENT '卖方营业部',
  `sameplace` tinyint(1) DEFAULT NULL COMMENT AS `是否为同一家营业部买卖`,
  `increaseone` varchar(32) DEFAULT NULL COMMENT AS `1 日涨幅`,
  `increasetwo` varchar(32) DEFAULT NULL COMMENT AS `2日涨幅`,
  `increasefive` varchar(32) DEFAULT NULL COMMENT AS `5日涨幅`,
  `increaseten` varchar(32) DEFAULT NULL COMMENT AS `10日涨幅`,
  `increasefifteen` varchar(32) DEFAULT NULL COMMENT AS `15日涨幅`,
  `increasetwenty` varchar(32) DEFAULT NULL COMMENT AS `20日涨幅`,
  `ontop` tinyint(1) DEFAULT NULL COMMENT AS `是否上龙虎榜`,
  `toptype` varchar(255) DEFAULT NULL COMMENT AS `上榜类型`
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `bigtrade`
--

INSERT INTO `bigtrade` (`date`, `num`, `name`, `dealprice`, `closeprice`, `islimited`, `discount`, `volume`, `volumemoney`, `dealrate`, `buy`, `sell`, `sameplace`, `increaseone`, `increasetwo`, `increasefive`, `increaseten`, `increasefifteen`, `increasetwenty`, `ontop`, `toptype`) VALUES
('2016-11-29', '002751', '易尚展示', 52.77, 57.72, 0, -8.58, 17, 897.09, 0.05, '广发证券股份有限公司普宁流沙证券营业部', '广发证券股份有限公司福清清昌大道证券营业部', 0, '0.62,1.96,-0.42', '', '', '', '', '', 0, ''),
('2016-11-29', '002762', '金发拉比', 39.18, 40.41, 0, -3.04, 79, 3095.22, 0.06, '中信建投证券股份有限公司深圳福中路证券营业部', '中信建投证券股份有限公司合肥长江西路证券营业部', 0, '-0.15,1.00,-2.00', '', '', '', '', '', 0, ''),
('2016-11-29', '002762', '金发拉比', 39.18, 40.41, 0, -3.04, 51, 1998.18, 0.04, '华鑫证券有限责任公司深圳益田路证券营业部', '中信建投证券股份有限公司合肥长江西路证券营业部', 0, '-0.15,1.00,-2.00', '', '', '', '', '', 0, ''),
('2016-11-29', '300010', '立思辰', 19.12, 19.71, 0, -2.99, 135, 2581.2, 0.12, '华泰证券股份有限公司南京分公司', '华泰证券股份有限公司徐州建国西路证券营业部', 0, '2.19,2.85,-0.31', '', '', '', '', '', 0, ''),
('2016-11-29', '300013', '新宁物流', 15.01, 15.39, 0, -2.47, 300, 4503, 0.83, '东兴证券股份有限公司济南解放路证券营业部', '中信证券股份有限公司北京复外大街证券营业部', 0, '-0.52,1.37,-0.85', '', '', '', '', '', 0, ''),
('2016-11-29', '300063', '天龙集团', 32.94, 34.1, 0, -3.4, 400, 13176, 0.2, '华泰证券股份有限公司北京雍和宫证券营业部', '中信证券股份有限公司芜湖新时代商业街证券营业部', 0, '-1.86,0.68,-2.97', '', '', '', '', '', 0, ''),
('2016-11-29', '300063', '天龙集团', 32.94, 34.1, 0, -3.4, 270, 8893.8, 0.14, '华泰证券股份有限公司重庆春晖路证券营业部', '中信证券股份有限公司芜湖新时代商业街证券营业部', 0, '-1.86,0.68,-2.97', '', '', '', '', '', 0, ''),
('2016-11-29', '300063', '天龙集团', 32.94, 34.1, 0, -3.4, 240, 7905.6, 0.12, '中国银河证券股份有限公司南京上海路证券营业部', '中信证券股份有限公司芜湖新时代商业街证券营业部', 0, '-1.86,0.68,-2.97', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 158, 2351.04, 0.26, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中国民族证券有限责任公司上海南丹东路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 158, 2351.04, 0.26, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中国国际金融股份有限公司深圳福华一路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 122, 1815.36, 0.2, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中国民族证券有限责任公司上海南丹东路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 93, 1383.84, 0.16, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中信证券股份有限公司西安未央路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 80, 1190.4, 0.13, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中信证券股份有限公司上海沪闵路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 76, 1130.88, 0.13, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中信证券股份有限公司西安未央路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 50, 744, 0.08, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中国国际金融股份有限公司上海分公司', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300091', '金通灵', 14.88, 14.83, 0, 0.34, 50, 744, 0.08, '中国国际金融股份有限公司北京建国门外大街证券营业部', '中国民族证券有限责任公司上海南丹东路证券营业部', 0, '-1.28,0.00,-2.89', '', '', '', '', '', 0, ''),
('2016-11-29', '300092', '科新机电', 13.67, 14.72, 0, -7.13, 260, 3554.2, 0.6, '东北证券股份有限公司重庆科园一路证券营业部', '华西证券股份有限公司什邡东顺城街证券营业部', 0, '-3.14,0.00,-3.75', '', '', '', '', '', 0, ''),
('2016-11-29', '300092', '科新机电', 13.67, 14.72, 0, -7.13, 130, 1777.1, 0.3, '东北证券股份有限公司重庆科园一路证券营业部', '华西证券股份有限公司什邡东顺城街证券营业部', 0, '-3.14,0.00,-3.75', '', '', '', '', '', 0, ''),
('2016-11-29', '300122', '智飞生物', 16.99, 18.2, 0, -6.65, 2700, 45873, 6.42, '华西证券股份有限公司成都高升桥路证券营业部', '兴业证券股份有限公司晋江崇德路证券营业部', 0, '5.61,9.74,-0.06', '', '', '', '', '', 0, '');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bigtrade`
--
ALTER TABLE `bigtrade`
  ADD UNIQUE KEY `date` (`date`,`num`,`dealprice`,`buy`,`sell`,`volume`) USING BTREE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
